app/controllers/air_ticket_reimbursements_controller.rb

    def set_air_ticket_reimbursement
      @air_ticket_reimbursement = AirTicketReimbursement.find(params[:id])
---
SELECT  "air_ticket_reimbursements".* FROM "air_ticket_reimbursements" WHERE "air_ticket_reimbursements"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]