app/controllers/card_profiles_controller.rb

  def show
    authorize CardProfile
    params.require(:id)
    profile = CardProfile.find(params[:id])
---
SELECT  "card_profiles".* FROM "card_profiles" WHERE "card_profiles"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]