app/controllers/performance_interviews_controller.rb

  def set_appraisal
    @appraisal = Appraisal.find(params[:appraisal_id])
---
SELECT  "appraisals".* FROM "appraisals" WHERE "appraisals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]